const vm = new Vue({
    el: "#app",
    data: {
        msg: "hello word",
        keylist:[
        ]
    },
    mounted(){
        const o = {
            0:[
                {
                    k:'序列号',
                    v:' 999999999999 ',
                },
                {
                    k:'牌号',
                    v:' DX51D+Z999 ',
                },
                {
                    k:'执行标准',
                    v:' GB/T 2518-999',
                },
                {
                    k:'钢卷号',
                    v:'  8882LN2B',
                },
                {
                    k:'规格',
                    v:'  1.00*1250*C',
                },
                {
                    k:'重量',
                    v:'  666',
                },
                {
                    k:'镀层种类',
                    v:'  GI',
                },
                {
                    k:'锌花种类',
                    v:'  零锌花',
                },
                {
                    k:'镀层重量',
                    v:'  40/40',
                },
                {
                    k:'光整处理',
                    v:'  光整',
                },
                {
                    k:'化学处理',
                    v:'  +3Cr钝化',
                },
                {
                    k:'涂油',
                    v:'  不涂油',
                },
                {
                    k:'产品等级',
                    v:'  FB',
                },
                {
                    k:'生产日期',
                    v:'  2099-02-27 16:39',
                },
            ],
            1:[
                {
                    k:'序列号',
                    v:' 620230227165504 ',
                },
                {
                    k:'牌号',
                    v:' DX51D+Z ',
                },
                {
                    k:'执行标准',
                    v:' GB/T 2518-2019',
                },
                {
                    k:'钢卷号',
                    v:'  3C3222LN2B',
                },
                {
                    k:'规格',
                    v:'  1.00*1250*C',
                },
                {
                    k:'重量',
                    v:'  7120',
                },
                {
                    k:'镀层种类',
                    v:'  GI',
                },
                {
                    k:'锌花种类',
                    v:'  零锌花',
                },
                {
                    k:'镀层重量',
                    v:'  40/40',
                },
                {
                    k:'光整处理',
                    v:'  光整',
                },
                {
                    k:'化学处理',
                    v:'  +3Cr钝化',
                },
                {
                    k:'涂油',
                    v:'  不涂油',
                },
                {
                    k:'产品等级',
                    v:'  FB',
                },
                {
                    k:'生产日期',
                    v:'  2023-02-27 16:39',
                },
            ]
        }
        this.keylist = o[getUrlKey("g",window.location.href)]
        
    },
})
function getUrlKey(name,url){
    　　return decodeURIComponent((new RegExp('[?|&]' + name + '=' + '([^&;]+?)(&|#|;|$)').exec(url) || [, ""])[1].replace(/\+/g, '%20')) || null
    
    }
